app/controllers/historic_places_controller.rb

  def index
    if params[:lat] && params[:lng]
      select = "id,title,lat,lng"
      group = "id,title,lat,lng HAVING ((ACOS(SIN(#{params[:lat]} * PI() / 180) * SIN(lat * PI() / 180) + COS(#{params[:lat]} * PI() / 180) * COS(lat * PI() / 180) * COS((#{params[:lng]} - lng) * PI() / 180)) * 180 / PI()) * 60 * 1.1515) <= 3"
      order_by = "((ACOS(SIN(#{params[:lat]} * PI() / 180) * SIN(lat * PI() / 180) + COS(#{params[:lat]} * PI() / 180) * COS(lat * PI() / 180) * COS((#{params[:lng]} - lng) * PI() / 180)) * 180 / PI()) * 60 * 1.1515)"
      @historic_places = HistoricPlace.all(:select => select, :group => group, :order => order_by)
---
SELECT id,title,lat,lng,((ACOS(SIN(42.4328548 * PI() / 180) * SIN(lat * PI() / 180) + COS(42.4328548 * PI() / 180) * COS(lat * PI() / 180) * COS((-71.0758026 - lng) * PI() / 180)) * 180 / PI()) * 60 * 1.1515) FROM `historic_places` GROUP BY id,title,lat,lng HAVING ((ACOS(SIN(42.4328548 * PI() / 180) * SIN(lat * PI() / 180) + COS(42.4328548 * PI() / 180) * COS(lat * PI() / 180) * COS((-71.0758026 - lng) * PI() / 180)) * 180 / PI()) * 60 * 1.1515) <= 2 ORDER BY ((ACOS(SIN(42.4328548 * PI() / 180) * SIN(lat * PI() / 180) + COS(42.4328548 * PI() / 180) * COS(lat * PI() / 180) * COS((-71.0758026 - lng) * PI() / 180)) * 180 / PI()) * 60 * 1.1515)

  def show
    @historic_place = HistoricPlace.find(params[:id])
---
SELECT * FROM `historic_places` WHERE (`historic_places`.`id` = 1)