app/controllers/historic_places_controller.rb

  def info
    @historic_place = HistoricPlace.find(params[:id])
---
SELECT * FROM `historic_places` WHERE (`historic_places`.`id` = 1)