app/controllers/query_locations_controller.rb

  def index
    @query_locations = QueryLocation.all(:limit => 10, :order => 'updated_at DESC')
---
SELECT * FROM `query_locations` ORDER BY updated_at DESC LIMIT 10

  def mobile
    @query_locations = QueryLocation.all(:limit => 10, :order => 'updated_at DESC')
---
SELECT * FROM `query_locations` ORDER BY updated_at DESC LIMIT 10